#### BuiltInFailures.CurveFailures Members

---

|  |
| --- |
| BuiltInFailures CurveFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures CurveFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotFindAreaScheme | Can't find new Area Scheme for Area Boundary. |
| Public property Static member | CantKeepJoinTangent | Can't keep curve join tangent. |
| Public property Static member | CurveNotEditable | Lines created by massing or picking 3d path are not editable. |
| Public property Static member | CurveNotEditableWarn | Lines created by massing or picking 3d path are not editable. |
| Public property Static member | InvalidCurveForElement | End positions are invalid. |
| Public property Static member | LineTooShortError | Line is too short. |
| Public property Static member | LineTooShortWarning | Line is too short. |
| Public property Static member | PeriodicCurveBadParams | End positions are invalid. |
| Public property Static member | SelfIntersectingSpline | Self intersecting splines are not allowed in sketches. |
| Public property Static member | TooShort | Line is too short. |
| Public property Static member | TopLevelBelowBottomLevel | For curveElem support multiple levels, top level belows curve bottom level. |

# See Also

BuiltInFailures CurveFailures Class

Autodesk.Revit.DB Namespace